guides/pd-disaggregation/posting-overhead-analysis/logs/ucx-ib/itl-baseline/benchmark-isl4096-osl512-mc8.txt
---
pid: 85399
cwd: "/Users/rajjoshi"
command: "cd /Users/rajjoshi/workspace/llm-d/guides/pd-disaggregation && export KUBECONFIG=/Users/rajjoshi/.kube/config.waldorf && just benchmark 8 100 4096 512 2>&1"
title: "Run UCX benchmark ISL=4096 OSL=512 MC=8"
status: succeeded
started_at: 2026-08-05T22:50:19.498Z
running_for_ms: 70605    
---
Synced poker/Justfile.remote -> raj-dev/poker:/workspace/Justfile (BASE_URL=http://infra-pd-inference-gateway-istio.raj-dev.svc.cluster.local)
INFO 08-05 22:50:25 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-05 22:50:25 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 08-05 22:50:26 [interface.py:229] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 08-05 22:50:28 [main.py:49] Unspecified platform detected, switching to CPU Platform instead.
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7a6eb27d71a0>, trust_remote_code=False, seed=50225021, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-pd-inference-gateway-istio.raj-dev.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4096.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-6a5df336-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 08-05 22:50:30 [datasets.py:700] Sampling input_len from [4095, 4095] and output_len from [512, 512]
  0%|          | 0/100 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4096.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 100/100 [00:57<00:00,  1.75it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             8         
Request rate configured (RPS):           4096.00   
Benchmark duration (s):                  57.24     
Total input tokens:                      409500    
Total generated tokens:                  51200     
Request throughput (req/s):              1.75      
Output token throughput (tok/s):         894.51    
Peak output token throughput (tok/s):    1032.00   
Peak concurrent requests:                16.00     
Total token throughput (tok/s):          8048.81   
---------------Time to First Token----------------
Mean TTFT (ms):                          462.11    
Median TTFT (ms):                        229.68    
P99 TTFT (ms):                           2326.15   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          7.77      
Median TPOT (ms):                        7.78      
P99 TPOT (ms):                           7.80      
---------------Inter-token Latency----------------
Mean ITL (ms):                           7.77      
Median ITL (ms):                         7.78      
P99 ITL (ms):                            11.81     
==================================================

---
exit_code: 0
elapsed_ms: 70605
ended_at: 2026-08-05T22:51:30.103Z
---